# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of join statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
#!pip install sql_panda_wrapper --upgrade

#import SQL_Panda as sp

#df = sp.Sqldf("data.sqlite")
#help(sp.Sqldf)

In [2]:
#Your code here
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite',  detect_types=sqlite3.PARSE_COLNAMES)
c = conn.cursor()

In [3]:
ls

data.sqlite  data.sqlite3  images/  index.ipynb  README.md  venn.png

In [21]:
c.execute('''SELECT * FROM customers''')
df = pd.DataFrame(c.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in c.description]
df.head()

,customerNumber,customerName,contactLastName,contactFirstName,phone,addressLine1,addressLine2,city,state,postalCode,country,salesRepEmployeeNumber,creditLimit
0,103,Atelier graphique,Schmitt,Carine,40.32.2555,"54, rue Royale",,Nantes,,44000,France,1370,21000.00
1,112,Signal Gift Stores,King,Jean,7025551838,8489 Strong St.,,Las Vegas,NV,83030,USA,1166,71800.00
2,114,"Australian Collectors, Co.",Ferguson,Peter,03 9520 4555,636 St Kilda Road,Level 3,Melbourne,Victoria,3004,Australia,1611,117300.00
3,119,La Rochelle Gifts,Labrune,Janine,40.67.8555,"67, rue des Cinquante Otages",,Nantes,,44000,France,1370,118200.00
4,121,Baane Mini Imports,Bergulfsen,Jonas,07-98 9555,Erling Skakkes gate 78,,Stavern,,4110,Norway,1504,81700.00

In [29]:
c.execute('''SELECT * FROM orders''')
df = pd.DataFrame(c.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in c.description]
df.head()

,orderNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber
0,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363
1,10101,2003-01-09,2003-01-18,2003-01-11,Shipped,Check on availability.,128
2,10102,2003-01-10,2003-01-18,2003-01-14,Shipped,,181
3,10103,2003-01-29,2003-02-07,2003-02-02,Shipped,,121
4,10104,2003-01-31,2003-02-09,2003-02-01,Shipped,,141

In [16]:
#c.execute('''SELECT * FROM customers''')
#df = pd.DataFrame(c.fetchall()) #Take results and create dataframe
#df.columns = [i[0] for i in c.description]
#df.head()

## Display the names of all the employees in Boston.
Hint: join the employees and customers tables.

In [9]:
#Your code here
c.execute('''SELECT firstName, lastName FROM employees JOIN offices USING(officeCode) WHERE city="Boston" ''')
#df = pd.DataFrame(c.fetchall()) 
#df.columns = [i[0] for i in c.description]
#df.head()


c.fetchall()

[('Julie', 'Firrelli'), ('Steve', 'Patterson')]

## Do any offices have no employees?
Hint: Combine the employees and offices tables and use a group by.

In [15]:
#Your code here

c.execute('''SELECT city, count(*) FROM offices LEFT JOIN employees USING(officeCode) GROUP BY city''')
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df.head()

            city  count(*)
0         Boston         2
1         London         2
2            NYC         2
3          Paris         5
4  San Francisco         6

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary

In [38]:
c.execute('''SELECT city, count(*) FROM offices LEFT JOIN employees USING(officeCode) GROUP BY city''')
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df.head()

            city  count(*)
0         Boston         2
1         London         2
2            NYC         2
3          Paris         5
4  San Francisco         6

In [47]:
# Your code here
c.execute('''SELECT * FROM payments JOIN customers USING(customerNumber) WHERE creditLimit= 21000''')
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df.head()

ValueError: Length mismatch: Expected axis has 0 elements, new values have 16 elements

In [ ]:
# Your code here

## Level Up: Display the names of each product each employee has sold

In [ ]:
# Your code here

## Level Up: Display the Number of Products each employee has sold

In [ ]:
#Your code here

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!